server/test/tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="dev-esb-2" port="8007" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="dev-esb-2" type="snmp"></monitor>
  </monitoring>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration 

  during the first 3 minutes of the test, a new user will be created every 0.1 seconds-->
   <arrivalphase phase="1" duration="3" unit="minute">
     <users interarrival="0.1" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <!-- full url with server name, this overrides the "server" config value -->

    <request> <http url="/static/index.html" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/css/ageascope.css" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/css/bootstrap-3.2.0/bootstrap.min.css" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/libs/angular-1.2.26/angular.min.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/libs/angular-ui-0.11.0/ui-bootstrap-tpls.min.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/controllers/Main.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/controllers/Viper.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/controllers/Di.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/directives/Validate.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/services/Rest.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/services/Auth.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/services/Gui.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/services/System.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/services/Http.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/services/Ageascope.js" method="GET" version="1.1"></http> </request>
    <request> <http url="/static/app/ageascope.js" method="GET" version="1.1"></http> </request> 
    <!-- <thinktime value="20" random="true"></thinktime> -->
    <request> <http url="/client/info" method="POST" version="1.1" contents_from_file='/home/sczaja/git/ageascope/server/test/tsung/client_info.json'></http> </request>
   
  </session>
 </sessions>
</tsung>